driver-tests/jdbcbc/SQLServer/jdbcbc55_SQL_JBI/test/jdbcfind-all/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://j2ee.netbeans.org/wsdl/soapTrigger">
  <soapenv:Body>
    <soap:inputEle>
      <dummyinput>20</dummyinput>
    </soap:inputEle>
  </soapenv:Body>
</soapenv:Envelope>