driver-tests/jdbcbc/SQLServer/jdbcbc63_SQL_JBI/test/jdbcupdate-all/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:someNS="http://j2ee.netbeans.org/wsdl/soapTrigger">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <someNS:outputEle xmlns:someNS="http://j2ee.netbeans.org/wsdl/soapTrigger">
    <recordsUpdate>
      <part>9</part>
    </recordsUpdate>
  </someNS:outputEle>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
